Duet3D/Duet3Expansion/src/atmel/SAM4S_DFP/1.0.56/sam4s/atdf/ATSAM4S16C.atdf
      <value-group caption="" name="ADC_CGR__GAIN8">
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)" name="SE1_DIFF0_5" value="0x0"/>
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)" name="SE1_DIFF1" value="0x1"/>
        <value caption="Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE2_DIFF2" value="0x2"/>
        <value caption="Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE4_DIFF2" value="0x3"/>
      </value-group>
      <value-group caption="" name="ADC_CGR__GAIN9">
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)" name="SE1_DIFF0_5" value="0x0"/>
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)" name="SE1_DIFF1" value="0x1"/>
        <value caption="Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE2_DIFF2" value="0x2"/>
        <value caption="Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE4_DIFF2" value="0x3"/>
      </value-group>
      <value-group caption="" name="ADC_CGR__GAIN10">
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)" name="SE1_DIFF0_5" value="0x0"/>
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)" name="SE1_DIFF1" value="0x1"/>
        <value caption="Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE2_DIFF2" value="0x2"/>
        <value caption="Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE4_DIFF2" value="0x3"/>
      </value-group>
      <value-group caption="" name="ADC_CGR__GAIN11">
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)" name="SE1_DIFF0_5" value="0x0"/>
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)" name="SE1_DIFF1" value="0x1"/>
        <value caption="Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE2_DIFF2" value="0x2"/>
        <value caption="Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE4_DIFF2" value="0x3"/>
      </value-group>
      <value-group caption="" name="ADC_CGR__GAIN12">
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)" name="SE1_DIFF0_5" value="0x0"/>
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)" name="SE1_DIFF1" value="0x1"/>
        <value caption="Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE2_DIFF2" value="0x2"/>
        <value caption="Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE4_DIFF2" value="0x3"/>
      </value-group>
      <value-group caption="" name="ADC_CGR__GAIN13">
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)" name="SE1_DIFF0_5" value="0x0"/>
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)" name="SE1_DIFF1" value="0x1"/>
        <value caption="Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE2_DIFF2" value="0x2"/>
        <value caption="Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE4_DIFF2" value="0x3"/>
      </value-group>
      <value-group caption="" name="ADC_CGR__GAIN14">
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)" name="SE1_DIFF0_5" value="0x0"/>
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)" name="SE1_DIFF1" value="0x1"/>
        <value caption="Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE2_DIFF2" value="0x2"/>
        <value caption="Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE4_DIFF2" value="0x3"/>
      </value-group>
      <value-group caption="" name="ADC_CGR__GAIN15">
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)" name="SE1_DIFF0_5" value="0x0"/>
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)" name="SE1_DIFF1" value="0x1"/>
        <value caption="Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE2_DIFF2" value="0x2"/>
        <value caption="Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE4_DIFF2" value="0x3"/>
      </value-group>
      <value-group caption="" name="ADC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0" name="PASSWD" value="0x414443"/>
      </value-group>
    </module>
    <module caption="Chip Identifier" name="CHIPID" version="6417ZB">
      <register-group name="CHIPID">
        <register caption="Chip ID Register" name="CHIPID_CIDR" offset="0x0" rw="R" size="4">
          <bitfield caption="Version of the Device" mask="0x0000001F" name="VERSION"/>
          <bitfield caption="Embedded Processor" mask="0x000000E0" name="EPROC" values="CHIPID_CIDR__EPROC"/>
          <bitfield caption="Nonvolatile Program Memory Size" mask="0x00000F00" name="NVPSIZ" values="CHIPID_CIDR__NVPSIZ"/>
          <bitfield caption="Second Nonvolatile Program Memory Size" mask="0x0000F000" name="NVPSIZ2" values="CHIPID_CIDR__NVPSIZ2"/>
          <bitfield caption="Internal SRAM Size" mask="0x000F0000" name="SRAMSIZ" values="CHIPID_CIDR__SRAMSIZ"/>
          <bitfield caption="Architecture Identifier" mask="0x0FF00000" name="ARCH" values="CHIPID_CIDR__ARCH"/>
          <bitfield caption="Nonvolatile Program Memory Type" mask="0x70000000" name="NVPTYP" values="CHIPID_CIDR__NVPTYP"/>
          <bitfield caption="Extension Flag" mask="0x80000000" name="EXT"/>
        </register>
        <register caption="Chip ID Extension Register" name="CHIPID_EXID" offset="0x4" rw="R" size="4">
          <bitfield caption="Chip ID Extension" mask="0xFFFFFFFF" name="EXID"/>
        </register>
      </register-group>
      <value-group caption="" name="CHIPID_CIDR__EPROC">
        <value caption="ARM946ES" name="ARM946ES" value="0x1"/>
        <value caption="ARM7TDMI" name="ARM7TDMI" value="0x2"/>
        <value caption="Cortex-M3" name="CM3" value="0x3"/>
        <value caption="ARM920T" name="ARM920T" value="0x4"/>
        <value caption="ARM926EJS" name="ARM926EJS" value="0x5"/>
        <value caption="Cortex-A5" name="CA5" value="0x6"/>
        <value caption="Cortex-M4" name="CM4" value="0x7"/>
      </value-group>
