Duet3D/Duet3Expansion/src/atmel/SAM4S_DFP/1.0.56/sam4s/atdf/ATSAM4S16C.atdf
      <value-group caption="" name="CHIPID_CIDR__NVPSIZ">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="8 Kbytes" name="_8K" value="0x1"/>
        <value caption="16 Kbytes" name="_16K" value="0x2"/>
        <value caption="32 Kbytes" name="_32K" value="0x3"/>
        <value caption="64 Kbytes" name="_64K" value="0x5"/>
        <value caption="128 Kbytes" name="_128K" value="0x7"/>
        <value caption="160 Kbytes" name="_160K" value="0x8"/>
        <value caption="256 Kbytes" name="_256K" value="0x9"/>
        <value caption="512 Kbytes" name="_512K" value="0xA"/>
        <value caption="1024 Kbytes" name="_1024K" value="0xC"/>
        <value caption="2048 Kbytes" name="_2048K" value="0xE"/>
      </value-group>
      <value-group caption="" name="CHIPID_CIDR__NVPSIZ2">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="8 Kbytes" name="_8K" value="0x1"/>
        <value caption="16 Kbytes" name="_16K" value="0x2"/>
        <value caption="32 Kbytes" name="_32K" value="0x3"/>
        <value caption="64 Kbytes" name="_64K" value="0x5"/>
        <value caption="128 Kbytes" name="_128K" value="0x7"/>
        <value caption="256 Kbytes" name="_256K" value="0x9"/>
        <value caption="512 Kbytes" name="_512K" value="0xA"/>
        <value caption="1024 Kbytes" name="_1024K" value="0xC"/>
        <value caption="2048 Kbytes" name="_2048K" value="0xE"/>
      </value-group>
      <value-group caption="" name="CHIPID_CIDR__SRAMSIZ">
        <value caption="48 Kbytes" name="_48K" value="0x0"/>
        <value caption="192 Kbytes" name="_192K" value="0x1"/>
        <value caption="384 Kbytes" name="_384K" value="0x2"/>
        <value caption="6 Kbytes" name="_6K" value="0x3"/>
        <value caption="24 Kbytes" name="_24K" value="0x4"/>
        <value caption="4 Kbytes" name="_4K" value="0x5"/>
        <value caption="80 Kbytes" name="_80K" value="0x6"/>
        <value caption="160 Kbytes" name="_160K" value="0x7"/>
        <value caption="8 Kbytes" name="_8K" value="0x8"/>
        <value caption="16 Kbytes" name="_16K" value="0x9"/>
        <value caption="32 Kbytes" name="_32K" value="0xA"/>
        <value caption="64 Kbytes" name="_64K" value="0xB"/>
        <value caption="128 Kbytes" name="_128K" value="0xC"/>
        <value caption="256 Kbytes" name="_256K" value="0xD"/>
        <value caption="96 Kbytes" name="_96K" value="0xE"/>
        <value caption="512 Kbytes" name="_512K" value="0xF"/>
      </value-group>
      <value-group caption="" name="CHIPID_CIDR__ARCH">
        <value caption="SAM4SxA (48-pin version)" name="SAM4SxA" value="0x88"/>
        <value caption="SAM4SxB (64-pin version)" name="SAM4SxB" value="0x89"/>
        <value caption="SAM4SxC (100-pin version)" name="SAM4SxC" value="0x8A"/>
      </value-group>
      <value-group caption="" name="CHIPID_CIDR__NVPTYP">
        <value caption="ROM" name="ROM" value="0x0"/>
        <value caption="ROMless or on-chip Flash" name="ROMLESS" value="0x1"/>
        <value caption="Embedded Flash Memory" name="FLASH" value="0x2"/>
        <value caption="ROM and Embedded Flash Memory- NVPSIZ is ROM size- NVPSIZ2 is Flash size" name="ROM_FLASH" value="0x3"/>
        <value caption="SRAM emulating ROM" name="SRAM" value="0x4"/>
      </value-group>
    </module>
    <module caption="Cyclic Redundancy Check Calculation Unit" name="CRCCU" version="11001I">
      <register-group name="CRCCU">
        <register caption="CRCCU Descriptor Base Register" name="CRCCU_DSCR" offset="0x000" rw="RW" size="4">
          <bitfield caption="Descriptor Base Address" mask="0xFFFFFE00" name="DSCR"/>
        </register>
        <register caption="CRCCU DMA Enable Register" name="CRCCU_DMA_EN" offset="0x008" rw="W" size="4">
          <bitfield caption="DMA Enable" mask="0x00000001" name="DMAEN"/>
        </register>
        <register caption="CRCCU DMA Disable Register" name="CRCCU_DMA_DIS" offset="0x00C" rw="W" size="4">
          <bitfield caption="DMA Disable" mask="0x00000001" name="DMADIS"/>
        </register>
        <register caption="CRCCU DMA Status Register" name="CRCCU_DMA_SR" offset="0x010" rw="R" size="4">
          <bitfield caption="DMA Status" mask="0x00000001" name="DMASR"/>
        </register>
        <register caption="CRCCU DMA Interrupt Enable Register" name="CRCCU_DMA_IER" offset="0x014" rw="W" size="4">
          <bitfield caption="Interrupt Enable" mask="0x00000001" name="DMAIER"/>
        </register>
        <register caption="CRCCU DMA Interrupt Disable Register" name="CRCCU_DMA_IDR" offset="0x018" rw="W" size="4">
          <bitfield caption="Interrupt Disable" mask="0x00000001" name="DMAIDR"/>
        </register>
        <register caption="CRCCU DMA Interrupt Mask Register" name="CRCCU_DMA_IMR" offset="0x001C" rw="R" size="4">
          <bitfield caption="Interrupt Mask" mask="0x00000001" name="DMAIMR"/>
        </register>
        <register caption="CRCCU DMA Interrupt Status Register" name="CRCCU_DMA_ISR" offset="0x020" rw="R" size="4">
          <bitfield caption="Interrupt Status" mask="0x00000001" name="DMAISR"/>
        </register>
        <register caption="CRCCU Control Register" name="CRCCU_CR" offset="0x034" rw="W" size="4">
          <bitfield caption="CRC Computation Reset" mask="0x00000001" name="RESET"/>
        </register>
        <register caption="CRCCU Mode Register" name="CRCCU_MR" offset="0x038" rw="RW" size="4">
          <bitfield caption="CRC Enable" mask="0x00000001" name="ENABLE"/>
          <bitfield caption="CRC Compare" mask="0x00000002" name="COMPARE"/>
          <bitfield caption="Primitive Polynomial" mask="0x0000000C" name="PTYPE" values="CRCCU_MR__PTYPE"/>
          <bitfield caption="Request Divider" mask="0x000000F0" name="DIVIDER"/>
        </register>
        <register caption="CRCCU Status Register" name="CRCCU_SR" offset="0x03C" rw="R" size="4">
          <bitfield caption="Cyclic Redundancy Check Value" mask="0xFFFFFFFF" name="CRC"/>
        </register>
